"""  Программа запрашивает у пользователя строку чисел, разделенных пробелом.
При нажатии Enter должна выводиться сумма чисел.
Пользователь может продолжить ввод чисел, разделенных пробелом и снова нажать Enter.
Сумма вновь введенных чисел будет добавляться к уже подсчитанной сумме.
Но если вместо числа вводится специальный символ, выполнение программы завершается.
Если специальный символ введен после нескольких чисел,
то вначале нужно добавить сумму этих чисел к полученной ранее сумме и после этого завершить программу."""


def my_func():
    total = 0
    a = False
    while not a:
        user_num = input('Введите числа или нажмите q для выхода: ').split()
        result = 0
        for i in range(len(user_num)):
            if user_num[i] == 'q':
                a = True
                break
            else:
                result += int(user_num[i])
        total += result
        print(total)


my_func()
